backend/app/controllers/api/v1/images_controller.rb

SELECT "images".* FROM "images"
---
    def index
        images = Image.all

INSERT INTO "images" ("image_url", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
        image = Image.new(image_params)
        if image.save

SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        image = Image.find_by_id(params[:id])

SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 16]]
---
    def destroy
        image = Image.find_by_id(params[:id])
        image.destroy